doc: update data flow
